app/controllers/ideas_controller.rb

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Tulkas"], ["description", "World of Warcraft"], ["picture", "Artas.jpg"], ["created_at", "2016-04-19 10:26:07.364808"], ["updated_at", "2016-04-19 10:26:07.364808"]]

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "name" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["name", "Artas"], ["updated_at", "2016-04-19 12:29:10.797564"], ["id", 1]]